#!/usr/bin/python3

# Выведите на экран надпись Nothing will work unless you do на разных строках.

print('\tNothing\n\twill work\n\tunless you do'.expandtabs(20))
